;; -*- coding: utf-8 -*-
;; File: signature-motto.el
;;
;; Author: Denny Zhang(markfilebat@126.com)
;; Created: 2009-08-01
;; Updated: Time-stamp: <2011-12-12 23:04:31>
;;
;; --8<-------------------------- §separator§ ------------------------>8--
(setq common-sign-motto
      '(
        "快乐并痛苦着,人生真无奈"
        "无尽的等待催人老"
        "千万不要因为有一天你得到了整个世界却丧失了自我灵魂 -- 鲍勃.马利"
        "汝不可求闲而叫苦喊累"
        "没有人情的政治是短命的"
        "汝不可因难而妄自薄菲"
        "汝不可推考而功亏一篑"
        "汝不可因败而万念具灰"
        "别想过去,别想将来,想想现在"
        "路走对了,就不怕走远"
        "伟人之所以为伟人,只不过他克服惰性多一点"
        "关心你的技术,然后你的技术才会关心你"
        "任何一次对自己的原谅,都会导致下一次更大的错误"
        "Never use the last bullet!"
        "凡事只要不用人去操心了,我们就可以暂时认为这事儿就不存在了。"
        "人的能力都是在做事的过程中提升的"
        "我们的痛苦不是问题本身带来的,而是我们对这些问题的看法产生的"
        "没有比解决瓶颈更高效的事情了"
        "需要对核心细节进行深入了解"
        "有效沟通的目的是拿到充分、正确的信息,来做出有利的决断"
        "爱所有人,信少数人,不欺负任何人。"
        "幸福就是好的身体和坏的记忆。"
        "项目沟通的最大目的是最大限度地发挥团队的合力"
        "加班加点,废寝忘食有时很可能是不具备效率和工作能力的表现"
        "如果你能将学到的东西解释给一个十岁的孩子,让他听懂,你一定是学会了"
        "中午不睡,下午崩溃 。。。"
        "在管理的世界中,　最困难的事情就是把一件你很拿手的工作交
给别人,再眼睁睁地看着他把事情搞砸,而你却还能心平气和的不发一言。"
        "你和时间开玩笑,它却对你很认真。"
        "读书不一定改变一个人的命运, 可是却实实在在地改变一个人。"
        "你所浪费的今天,是昨天死去的人奢望的明天;你所厌恶的现在,是
未来的你回不去的曾经。——哈佛大学校训"
        "可以相信别人,但不可以指望别人。"
        "越是接近人生的最高阶段,别人越是帮不上忙。每个人的顶峰都
是独特的,这独一无二的风景,世上没有任何人曾有过相同体验。此时,任
何帮助都会变成干扰,任何期待都是一种松懈。"
        "Don't make wrong decision and do it in a wrong way, due to schedule pressure"
        "Don't attend meeting without preparation!"
        "All human beings are born creative. We all have good ideas.
But on the path from idea to creation we can be ambushed by fear,
doubt and uncertainty – and that often means that great ideas
land up dead in the dust, instead of coming to fruition."
        "你想要管理的事情越平淡无奇,你的系统就需要越复杂才能把它们管理好。"
        "明晰对方提出意见的真实目的"
        "任何一个高级的知识内容,其中都只有一小部分是有思想创新、
有重大影响的,而其它很多东西都是琐碎的、非本质的。"
        "成功的买卖,都是以双赢为目标开始的。"
        "自由从自信而来, 而自信则是从自律来!
先学会克制自己,用严格的日程表控制生活,才能在这种自律中不断磨练出自信。
自信是对事情的控制能力,如果你连最基本的时间都做控制不了,还谈什么自信？"
        "跟踪移交他人处理的工作"
        "对所做的事情的理解越深,你就会做的越好。"
        "一次温暖的握手抵得上一万次微博"
        "别让孩子替你实现梦想"
        "有没有想过,也许一辈子你都是个小人物"
        "一位单身女子刚搬完家,晚上忽然停电。她刚点燃一支蜡烛,听
见了敲门声。她打开门,是隔壁的小女孩,小女孩问:“阿姨,你家里有蜡
烛吗？”单身女子心想:这才刚来就这样,以后会怎样。于是她冷冰冰的说
“没有”。小女孩笑了:“妈妈怕你害怕,让我给你送来了。”"
        "纪伯伦:我们已走得太远,以至于我们忘了为什么而出发"
        "人生最大的投资,不是房子,不是股票,是人。 钱不会给人机会,
房子也不会,只有人会给人机会,当人需要帮助的时候,只有人会帮人。"
        "如果一个系统或者一个模块设计时没有想好怎么测试, 说明设计做得还不够。"
        "用心做事做人的, 必定会与众不同。"
        "有时候傻坚持要比不坚持好很多, 如果空有理想,没有坚持,理想将变成一种痛苦。"
        "真正的效率源自于内心对一个东西强烈的热忱, 也就是俗称的追
求, 这时从表层意识到深层意识都关注在这件事情上面, 脑细胞高度活跃,
才能创造最大的效益。"
        "任何一件事情,只要是心甘情愿,总是能够变得简单。"
        "如果你想要造一艘船,先不要雇人去收集木头,也不要分配任务,而是去激发他们对海洋的渴望。"
        "有些事现在不做,一辈子都不会做。"
        "什么叫爱好？爱好就是在业余时间用专业精神去做的业余事情。"
        "“当一个政府或部门失去公信力时,不论说真话还是假话,做好事
还是坏事,都会被认为是说假话、做坏事。”——古罗马历史学家塔西陀"
        "社交之所以累,是因为都想表现出自己其实并不具备的素质。"
        "要么深度, 要么有趣, 要么安静。"
        "如果有什么事情让你感到恐惧或者兴奋,那就去做吧。"
        "所有的孩子都是在玩耍时学习的。"
        "行善:鲁国规定凡鲁人在国外见到本族人被卖当奴,可赎之回国
库报账。孔子学生赎一奴,却不报账,人人夸学生高尚。孔子很不满,学生
问救而不报账,岂不更高尚。孔子骂:呆货,以后别人要是赎了奴去报账,
就会被骂不高尚;不报账,做好事又成了亏本的事。渐渐人们就会装没看有
人做奴,渐渐就没人做好事。"
        "授权就像是放风筝, 对方能力弱就收收, 对方能力强就放放。"
        "一名记者采访一个从事编程的工程师,并问了他一个典型的问题:
“你怎样判断一个函数或者方法太大了？”被采访者说,“我不喜欢任何比我
头还大的方法。”“你时说那些无法将所有细节都记到脑子里的方法？”“不,
我是说我把我的头放在显示器上,然后那段代码不应该比我的头还大。”"
        "对员工不应是管理, 而应是激励。"
        "一个只有学计算机的孩纸才明白的冷笑话:烫烫烫烫烫烫烫烫烫烫烫, 屯屯屯屯屯屯屯屯屯屯屯屯屯。"
        "上课的区别:小学上课费嘴,初中上课费笔,高中上课费脑,大学上课费流量,工作时上课费钱。"
        "他散尽万贯家财,终于获得了一次穿越的机会,他回到了1998年,
找到了那个犹豫不决,手握50万现金的青年,告诉他:“买房子吧,10年后,
房价会翻好几个跟头的。”那个人说:“真的的太谢谢你了！请问你贵姓？你
认识我吗？”他诡异的一笑:“我当然认识你,化腾。我叫周鸿祎。"
        "别兜售你不相信的东西,别为你不敬佩的人工作,别和你不喜欢的人共事 —— 芒格"
        "《程序员的雨巷》开着emacs,独自编写着悠长、悠长又无聊的
ErLang,我希望编译出来的结果是一个美丽的姑娘。她是有lua一样的风骚,
c一样的贤惠,lisp一样的慈祥,与我在ubuntu里牵手,拥抱又疯狂;梦醒,
她仅仅是这无聊的ErLang。"
        "不能因为一个人心地善良就原谅他的无能, 更不能因为一个人有表演天赋就大加赞扬。"
        "我们失去了饥饿感, 所以很难活得那么真实了。"
        "如何实现可维护的软件是高级工程师的价值所在。"
        "团队里面善于质疑的人最容易获得成长; 安于现状的每天都是在重复自己。"
        "用8小时工作, 用24小时思考。 同样的工作, 不同的人会有不同的绩效,差异在于业余时间的思考。"
        "上联: 大四的看大三的教大二的怎么骗大一的。 下联: 大一的听大二的讲大三的怎么甩大四的。 横批: 大三最牛"
        "你就是一道风景 ,没必要在别人风景里面仰视。"
        "对别人的情感最大的伤害就是欺骗。"
        "Most of what we learn, we learn indirectly"
        "Experience is what you get when you didn't get what you wanted."
        "毕业答辩,台下坐满老师, 台上同学讲得支支吾吾, 基本就不
懂, 其中最牛的一个都是发话: 你导师是谁, 怎么这么不负责任,基本
知识都不懂？ 只见该同学还是支支吾吾, 老师发火了, 快说！ 同学蹦出
两字, 是你！！"
        "人生最苦痛的是梦醒了无路可走。做梦的人是幸福的。倘没有看出可走的路,最要紧的是不要去惊醒他。"
        "一种技能如同一块肌肉,一旦缺乏反复的训练,它就会渐渐萎缩。"
        "那些不和别人比较,专注于自己世界的人们是幸福的。他们热爱
自己的学习,热爱自己的工作, 热爱自己的生命。生命的本质在于生命的
乐趣,这一乐趣是持久而宁静的,不是转瞬即逝的。因此这一乐趣必须来自
心灵而不是来自对于现实物质的拥有。和物质的满足相比,心灵的富足是真
正快乐的源泉。"
        "我国火车专用对联。上联: 啤酒饮料矿泉水; 下联:　花生瓜子八宝粥;　横批:　让一下,　让一下"
        "一分钟有多长？这要看你是蹲在厕所里,还是等在厕所外。"
        "世界上最遥远的距离,是我在if里你在else里,似乎一直相伴又永远分离 -- 我是程序员"
        "世界上最痴心的等待,是我当case你是switch,或许永远都选不上自己 -- 我是程序员"
        "任由感觉左右行为是不负责任的做法。"
        "除非你同意, 没有任何人可以伤害到你。"
        "作息时间表是一种自我约束。"
        "对休息时间的掌握要学习长跑运动员。在马拉松赛场上,运动员们
都明确自己的实力,知道什么时候该休息,什么时候该努力追赶。在开始阶
段,虽然体力充沛,但也不能往前冲,也要适当休息,在结束阶段,在疲惫的情
况也要调节好体能,适当休息,只有这样才能在冲过终点线的时候取得好成绩。"
        "世界上最真情的相依,是你在try我在catch。无论你发神马脾气,
我都默默承受,静静处理。到那时,再来期待我们的finally - 我是程序员"
        "走出考场,她哭的一塌糊涂。考生们都看着这么一个漂亮的女孩
子哭的梨花带雨。他不顾旁人的眼光,一把揽过她,凶狠狠的说,“再哭我
就当众吻你。她哭的更厉害了,“数学好难,我们不能上同一所大学了啦。
“笨蛋,就知道你不会,后面的大题我都没做。后来他考上了蓝翔, 而她妈
送她去国外读大学了。 "
        ))

;; 要好朋友可见
(setq close-friend-sign-motto
      '(
        "当你决定要创业时, 便意味着: 1、没有了稳定的收入 2、没有
请假的权利 3、没有了得红包的机会。 然后这更意味着: 1、收入不再受
限制 2、时间运用更有效 3、手心向下不求人。 想法若不同, 结果便不同,
选择不一样, 生活才变样。 －－ 马云"
        "命,乃失败者的借口;运,乃成功者的谦辞。"
        "你因为满腔热情、认定一样事情,而去创业,还是因为不满意目前的生活状态,便考虑换一种模式？"
        "如果你把工作搞砸了,你总可以再找另外一个工作,但如果你把
家庭关系搞砸了,特别是跟孩子的关系,你永远无法弥补,你会一辈子背负
这个债务。"
        "你必须非常努力,才能看起来毫不费力"
        "当你超过别人一点点,别人会嫉妒你;当你超过别人一大截,别人就会羡慕你。"
        "很多时候,在办公室里一起工作三年,不如出差畅谈一夜能增进了解。"
        "许多人的所谓成熟, 不过是被习俗磨中去了棱角, 变得世故而
实际了。那不是成熟,而是精神的早衰和个性的夭亡。 真正的成熟,应当
是独特个性的形成, 真实自我的发现, 精神上的结果和丰收。"
        "吕布固执于自己的方天划吉,赤兔马和高强的技艺。"
        "只有生产低级产品的企业,才把竞争力完全建立在劳动力成本上。"
        "说真话会得罪一些人,但却会更容易找到知音。"
        "公开发表你的思考,你将因感到来自公众的积极的压力而坚持下去"
        "男人需要幽默,就像女人需要一个漂亮的脸蛋一样重要"
        "如果一个人什么生活嗜好都没有,那么他往往也没有好朋友。"
        "无论发生怎样的变故,不要打破生活原有的规律,要按时吃饭,按时睡觉。"
        "知错改错, 不可轻易认错"
        "工作需求与圈子极大地影响个人的能力"
        "老板对你的投资主要是为了你未来的贡献,而不是回报你的过去"
        "男人需要幽默,就像女人需要一个漂亮的脸蛋一样重要"
        "Ugly, I know. But it works."
        "【高效能人士7个习惯】
1、主动积极（个人愿景的原则）;
2、以终为始（自我领导的原则）;
3、要事第一（自我管理的原则）;
4、双赢思维（人际领导的原则）;
5、知彼解己（移情沟通的原则）;
6、统合综效（创造性合作的原则）;
7、不断更新（平衡的自我更新的原则） —— 史蒂芬·柯维"
        "人生五大发展阶段:首先自己要行;其次要有人说你行;再次,说你
行的人要行;然后,你说谁行谁就行;最后,谁敢说你不行。"
        "长大成人这件事最恐怖的地方之一在于,你或许会变成自己曾经最看不起的那种人。"
        "我要一步一步往上爬/等待阳光静静看着它的脸/小小的天有大大
的梦想/重重的壳裹着轻轻的仰望/我要一步一步往上爬/在最高点乘着叶片
往前飞/小小的天留过的泪和汗/总有一天我有属于我的天 ---- 周杰伦《蜗
牛》"
        "爸爸: 儿子你觉得爸爸壮吗？ 儿子: 嗯。 爸爸: 你觉得少林
功夫厉害吗？ 儿子: 厉害。 爸爸: 如果我剃成光头, 练少林功夫好吗？
儿子拍手: 太好了。 第二天, 儿子看到光头的爸爸, 高兴地说: 爸爸
加油, 一定要练成高手。 那天, 是爸爸化疗的前一天。 那天, 爸爸用
特有的方式教会了儿子乐观和勇敢。"
        "小丸子问: “为什么只能说女儿像爸爸, 不说爸爸像女儿呢？“
爸爸说: ”我问你, 是先有爸爸还是先有女儿？“ ”当然是先有女儿, 后
有爸爸。 “ 小丸子理直气壮地说, ”在妈妈生了我以后, 你才成了爸爸的！
“ 。。。"
        "越是重要的决定,越要自己去抉择。容不得别人掺和。"
        "一哥们儿隔壁新搬来了个老外, 一天晚上老外敲门求助, 说:
“我的电视坏了, 不能换台。” 这哥们儿低头看了眼表, 很镇定
的说: ”过了七点半就好了。。。“" ))

;; 爱人可见
(setq lover-sign-motto
      '(
        "我很丑,但我不懂温柔,也不会浪漫,更不会说甜言蜜语,因为我是一个很丑的流氓"
        "“要听话”用来抹杀自由,“要孝顺”用来抹杀独立,“就你跟大家不
一样”用来抹杀个性,“别整天琢磨那没用的”用来抹杀想象力,“少管闲事”
用来抹杀公德心, “养你这孩子有什么用”用来抹杀自尊,“我不许你跟他/
她在一起”用来抹杀爱情——这就是中国父母著名的“七种武器”"
        "人生得一知己足已"
        "两个人吵架,先说对不起的人,并不是认输了,并不是原谅了。他只是比对方,更珍惜这份感情。"
        "'爱'和'喜欢'的区别很简单, 如果你爱花你会给它浇水, 喜欢则会摘下它"
        "真羡慕你这么年轻就认识我了。"
        "友谊意味着两个人和世界,然而爱情意味着两个人就是世界"
        "丝袜是权力的象征,女人穿了能征服男人,男人戴了可以征服银行。"
        "人生苦短,必须性感。"
        "开始相爱不是因为找到一个完美的人, 而是因为学会了完美地看待一个不完美的人。"
        "找不到我喜欢的伞,我宁愿淋雨。"
        "家庭的幸福需夫妻共同努力,而破坏它,一人就够了。"
        "我等着你回来,我等着你回来~~"
        "结婚以前自己那是吉普越野车,愿意往哪开就往哪开,爱怎么开
怎么开。结婚后那就是火车啦,那得按轨道跑,准时准点还不能出轨。若有
孩子了,不仅不能出轨,还得拉货。"
        "宁愿悲哀的深刻,不愿开心的肤浅。"
        "爱对一個人,人生就等于做对了大部分的事情。"
        "青春不常在,抓紧谈恋爱。"
        "世界上最疼痛的话是:“我爱你,但是……”。世界上最甜蜜的话是:“…… 但是,我爱你。”"
        "其实,你喜欢一个人,就赋予了他/她伤害你的权力"
        "幸福的关键不在于找到一个完美的人, 而在找到一个人, 然后和他一起努力, 建立一个完美的关系。"
        "在古代,我们不短信, 不网聊, 不漂洋过海, 不被堵在路上, 如果我想你, 就翻过两座山走五里路, 去牵你的手。 -- 蔡康永"
        "遇见你是命运的安排,成为了朋友是我的选择, 而爱上你是我无法控制的意外"
        "婚姻不是1+1=2, 而是0.5+0.5=1。 即, 两人各削去一半自己的个性和缺点, 然后凑合在一起才完整。。。"
        "为了我的奥迪, 你的迪奥, 咱孩子的奥利奥, 努力！奋斗！"
        ))
;; --8<-------------------------- §separator§ ------------------------>8--
;; File: signature-motto.el ends here
